country-quizzer-backend/app/controllers/api/v1/countries_controller.rb

  def index
    countries = Country.all
---
SELECT "countries".* FROM "countries"