country-quizzer-backend/app/controllers/api/v1/users_controller.rb

  def create
    user = User.find_or_create_by(user_params)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", ""], ["created_at", "2020-05-19 03:18:03.004892"], ["updated_at", "2020-05-19 03:18:03.004892"]]